### 1. DataFrame

In [1]:
import numpy as np
import pandas as pd

- 생성 방법 1 : 2차원 테이터 ,컬럼 ,인덱스

In [4]:
df1 = pd.DataFrame(
      np.random.randint(40,101,12).reshape(4,3), #2차원 데이터 
      columns=list('xyz'),                       # 컬럼명에 리스트로
      index=list('abcd')
)
df1

    x   y   z
a  96  91  97
b  76  83  95
c  67  72  46
d  87  82  57

- 생성 방법 2: 딕셔너리의 리스트

In [5]:
data = [
    {'X' :50, 'Y' : 70, 'z':90},
    {'X' :40, 'Y' : 60, 'z':45},
    {'X' :30, 'Y' : 50, 'z':86},
    {'X' :20, 'Y' : 77, 'z':90}
]
df2 =pd.DataFrame(data,index=list('abcd'))
df2

    X   Y   z
a  50  70  90
b  40  60  45
c  30  50  86
d  20  77  90

- 생성 방법 3:데이터가 value,컬럼명이 key가 되는 딕셔너리

In [8]:
data ={
    'X':[50,40,30,20],
    'Y':[70,60,50,77],
    'Z':[91,45,86,90]
}
df3 = pd.DataFrame(data,index=list('abcd'))
df3

    X   Y   Z
a  50  70  91
b  40  60  45
c  30  50  86
d  20  77  90

In [9]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [11]:
df.values              # 넘파이 정렬로 가져옴

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [12]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [13]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [14]:
df.index.name = '도시'
df.columns.name = '항목'
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [16]:
data ={
    'X':[50,40,30,20],
    'Y':['사과','체리','복숭아','키위'],
    'Z':[0.002,0.567,0.4853,6.255]
}
df10 = pd.DataFrame(data,index=list('abcd'))
df10

    X    Y       Z
a  50   사과  0.0020
b  40   체리  0.5670
c  30  복숭아  0.4853
d  20   키위  6.2550

- 연습문제 4.1.2

In [20]:
chr(65) +chr(90)           #랜덤으로 문자 만들어줌

'AZ'

In [21]:
col_a,col_b,col_c,col_d,col_e =[],[],[],[],[]
np.random.seed=2023
for i in range(5):
    col_a.append(chr(np.random.randint(65,91))  + chr(np.random.randint(65,91)))
    col_b.append(np.random.randint(1,7))
    col_c.append(np.random.randint(40,101))
    col_d.append(np.random.randint(1,100)*1000)
    col_e.append(np.round(np.random.rand(),4))
df4=pd.DataFrame(
    {'col_a':col_a,'col_b':col_b,'col_c':col_c,'col_d':col_d,'col_e':col_e}
)
df4

  col_a  col_b  col_c  col_d   col_e
0    KM      4     70  65000  0.8803
1    PJ      3     95  59000  0.2125
2    PP      5     76  67000  0.1724
3    GD      1     87  46000  0.2091
4    PH      2     62  37000  0.4823

In [27]:
data = [ ]
for i in range(5):
    d = {'col_a':chr(np.random.randint(65,91)) + chr(np.random.randint(65,91)),
         'col_b':np.random.randint(1,7),
         'col_c':np.random.randint(40,101),
         'col_d':np.random.randint(1,100)*1000,
         'col_e':np.round(np.random.rand(),4)
         }
    data.append(d)
df5 = pd.DataFrame(data)
df5

  col_a  col_b  col_c  col_d   col_e
0    KQ      1     84  85000  0.6809
1    UG      3     98  18000  0.9813
2    DO      6     64  36000  0.6870
3    BF      1     82  91000  0.5130
4    PD      6     59  46000  0.9919

- 전치(Transpose)

In [28]:
df1.T

    a   b   c   d
x  96  76  67  87
y  91  83  72  82
z  97  95  46  57

In [29]:
df5.T

            0       1      2      3       4
col_a      KQ      UG     DO     BF      PD
col_b       1       3      6      1       6
col_c      84      98     64     82      59
col_d   85000   18000  36000  91000   46000
col_e  0.6809  0.9813  0.687  0.513  0.9919

- 열 데이터의 갱신,추가,삭제

In [30]:
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [31]:
df['2010-2015 증가율'] =df['2010-2015 증가율'] * 100
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [35]:
# 열 이름이 있으면 갱신,없으면 생성
df['2010-2015 증가율'] = ((df['2010']- df['2005']) / df['2005']*100).round(2)
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [36]:
# 열 삭제
del df['2010-2015 증가율']
df

항목   지역     2015     2010     2005     2000
도시
서울  수도권  9904312  9631482  9762546  9853972
부산  경상권  3448737  3393191  3512547  3655437
인천  수도권  2890451  2632035  2517680  2466338
대구  경상권  2466052  2431774  2456016  2473990

- 열 인덱싱

In [38]:
df['지역']       # 열 이름을 하나만 선택하면 시리즈 반환

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [39]:
df[['2015','2010']]          # 열 이름을 여러개 리스트로 주면,테이터프레임 반환

항목     2015     2010
도시
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [40]:
df[['2015']]

항목     2015
도시
서울  9904312
부산  3448737
인천  2890451
대구  2466052

- 개별 인덱싱

In [43]:
# 열 이름,행 인덱스
df['2015']['서울'], df.지역['서울'], df.지역.서울

(9904312, '수도권', '수도권')

In [44]:
#컬럼명이 숫자이기 때문에 안됨
df.2015['서울']

SyntaxError: invalid syntax (2352625954.py, line 2)

- 연습 문제 4.1.3

In [45]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [53]:
#(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [57]:
#(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [61]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균'] =((df.국어+df.영어+df.수학) / 3).round(1)
df

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  40  70  46.7

In [63]:
#(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
import warnings
warnings.filterwarnings('ignore')
df['영어']['방자']= 80
df['평균'] =((df.국어+df.영어+df.수학) / 3).round(1)
df

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  80  70  60.0

In [64]:
#(5) 춘향의 점수를 데이터프레임으로 나타낸다.
df.T[['춘향']]

      춘향
국어  80.0
영어  90.0
수학  90.0
평균  86.7

In [66]:
df[:1]

    국어  영어  수학    평균
춘향  80  90  90  86.7

In [65]:
#(6) 향단의 점수를 시리즈로 나타낸
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64